In [2]:
from surprise import *
import pandas as pd
from surprise import accuracy
from surprise.model_selection.split import train_test_split
from surprise.model_selection import cross_validate, GridSearchCV
import numpy as np

In [3]:
# df= pd.read_csv('Final_usersData_withratings_600k.csv')

In [4]:
df

,Unnamed: 0,Unnamed: 0.1,reviewer_id,reviewer_name,soloTrip,FamilyTrip,Holiday,Business,short,long,listings,ratings
0,0,450033,64865321,Caitlin,0,1,0,1,1,0,118117,9
1,1,1178063,26272480,Cristina,1,0,0,1,0,1,545821,7
2,2,1984215,73490335,Bruno,1,0,0,1,0,1,55868,7
3,3,2371075,9938883,Román,0,1,0,1,0,1,85145,6
4,4,385286,3824717,Татьяна,1,0,0,1,1,0,305809,6
...,...,...,...,...,...,...,...,...,...,...,...,...
599995,599995,1782455,67625525,Kelly,1,0,0,1,1,0,59182,2
599996,599996,248816,4786209,Simon,0,1,0,1,1,0,21167,5
599997,599997,717051,13661577,Josh,1,0,0,1,0,1,203658,5
599998,599998,1464135,21627535,Višnja,1,0,1,0,1,0,135097,0
599999,599999,1931228,35505495,Jill,1,0,0,1,1,0,33114,0

In [5]:
df.isnull().sum()

Unnamed: 0       0
Unnamed: 0.1     0
reviewer_id      0
reviewer_name    0
soloTrip         0
FamilyTrip       0
Holiday          0
Business         0
short            0
long             0
listings         0
ratings          0
dtype: int64

In [6]:
df = df.drop(columns=['Unnamed: 0.1','Unnamed: 0'])

In [7]:
df

,reviewer_id,reviewer_name,soloTrip,FamilyTrip,Holiday,Business,short,long,listings,ratings
0,64865321,Caitlin,0,1,0,1,1,0,118117,9
1,26272480,Cristina,1,0,0,1,0,1,545821,7
2,73490335,Bruno,1,0,0,1,0,1,55868,7
3,9938883,Román,0,1,0,1,0,1,85145,6
4,3824717,Татьяна,1,0,0,1,1,0,305809,6
...,...,...,...,...,...,...,...,...,...,...
599995,67625525,Kelly,1,0,0,1,1,0,59182,2
599996,4786209,Simon,0,1,0,1,1,0,21167,5
599997,13661577,Josh,1,0,0,1,0,1,203658,5
599998,21627535,Višnja,1,0,1,0,1,0,135097,0
599999,35505495,Jill,1,0,0,1,1,0,33114,0

In [8]:
coli = []
for index, row in df.iterrows():
    temp = str(row.soloTrip) + str(row.FamilyTrip) + str(row.Holiday) + str(row.Business) + str(row.short) + str(row.long) + str(row.listings)
    coli.append(temp)
    
df['coli'] = coli

In [9]:
df

,reviewer_id,reviewer_name,soloTrip,FamilyTrip,Holiday,Business,short,long,listings,ratings,coli
0,64865321,Caitlin,0,1,0,1,1,0,118117,9,010110118117
1,26272480,Cristina,1,0,0,1,0,1,545821,7,100101545821
2,73490335,Bruno,1,0,0,1,0,1,55868,7,10010155868
3,9938883,Román,0,1,0,1,0,1,85145,6,01010185145
4,3824717,Татьяна,1,0,0,1,1,0,305809,6,100110305809
...,...,...,...,...,...,...,...,...,...,...,...
599995,67625525,Kelly,1,0,0,1,1,0,59182,2,10011059182
599996,4786209,Simon,0,1,0,1,1,0,21167,5,01011021167
599997,13661577,Josh,1,0,0,1,0,1,203658,5,100101203658
599998,21627535,Višnja,1,0,1,0,1,0,135097,0,101010135097
599999,35505495,Jill,1,0,0,1,1,0,33114,0,10011033114

In [ ]:
# notebook start from here

In [3]:
dfC= pd.read_csv('Final_usersData_listings_600k_combinedlistingID.csv')
dfC

,Unnamed: 0,reviewer_id,reviewer_name,soloTrip,FamilyTrip,Holiday,Business,short,long,listings,ratings,coli
0,0,64865321,Caitlin,0,1,0,1,1,0,118117,9,10110118117
1,1,26272480,Cristina,1,0,0,1,0,1,545821,7,100101545821
2,2,73490335,Bruno,1,0,0,1,0,1,55868,7,10010155868
3,3,9938883,Román,0,1,0,1,0,1,85145,6,1010185145
4,4,3824717,Татьяна,1,0,0,1,1,0,305809,6,100110305809
...,...,...,...,...,...,...,...,...,...,...,...,...
599995,599995,67625525,Kelly,1,0,0,1,1,0,59182,2,10011059182
599996,599996,4786209,Simon,0,1,0,1,1,0,21167,5,1011021167
599997,599997,13661577,Josh,1,0,0,1,0,1,203658,5,100101203658
599998,599998,21627535,Višnja,1,0,1,0,1,0,135097,0,101010135097
599999,599999,35505495,Jill,1,0,0,1,1,0,33114,0,10011033114

In [29]:
# ratCheck

,reviewer_id,reviewer_name,soloTrip,FamilyTrip,Holiday,Business,short,long,listings,ratings,coli
2727,76726,Patricia,1,0,0,1,1,0,28658,7,10011028658

In [30]:
# predict1 = SVDalgo.predict(uid=76726, iid= '10011028658')

In [31]:
# predict1

Prediction(uid=76726, iid='10011028658', r_ui=None, est=6.2534008335803675, details={'was_impossible': False})

In [4]:
df1 = dfC[['reviewer_id','coli','ratings']]

In [5]:
reader = Reader(rating_scale=(0,10))
dataSet=Dataset.load_from_df(df1,reader)

In [6]:
len(dfC.listings.unique())

600

In [7]:
train_df, test_df = train_test_split(dataSet, test_size=0.1)

In [ ]:
# user - prodcut  - SVD

In [50]:
SVDalgo = SVD(n_factors=400, reg_all=0.7, n_epochs=30)
SVDalgo.fit(train_df)
pred_svd = SVDalgo.test(test_df)

In [51]:
accuracy.rmse(pred_svd, verbose=True)

RMSE: 2.9411

2.9411469764828286

In [ ]:
# listing - listing based

In [16]:
op={
    'name':'msd',
    'user_based':False
}
knn=KNNBasic(sim_options=op,k=100,min_k=6)
knn.fit(train_df)
pred_knn=knn.test(test_df)

Computing the msd similarity matrix...
Done computing similarity matrix.

In [17]:
accuracy.rmse(pred_knn)

RMSE: 2.9491

2.949094208277043

In [18]:
op={
    'name':'cosine',
    'user_based':False
}
knnC=KNNBasic(sim_options=op,k=100,min_k=6)
knnC.fit(train_df)
pred_knnC=knnC.test(test_df)

Computing the cosine similarity matrix...
Done computing similarity matrix.

In [19]:
prediction1= pred_knnC.predict(uid=, iid=)
prediction1.est
accuracy.rmse(pred_knnC)

RMSE: 2.9482

2.9482036458253185

In [ ]:
 # user - user based

In [20]:
ops={
    'name':'msd',
    'user_based':True
}
knnU=KNNBasic(sim_options=ops,k=100,min_k=6)
knnU.fit(train_df)
predU_knn=knnU.test(test_df)

Computing the msd similarity matrix...
Done computing similarity matrix.

In [21]:
accuracy.rmse(predU_knn)

RMSE: 2.9499

2.949868408222363

In [22]:
ops={
    'name':'cosine',
    'user_based':True
}
knnUC=KNNBasic(sim_options=ops,k=100,min_k=6)
knnUC.fit(train_df)
predUC_knn=knnUC.test(test_df)

Computing the cosine similarity matrix...
Done computing similarity matrix.

In [23]:
accuracy.rmse(predUC_knn)

RMSE: 2.9496

2.949607730640756

In [ ]:
# dont run below cv thing not needed

In [20]:
CrossSVDalgo=SVD(n_factors=100,reg_all=0.006, n_epochs=30)
cross_validate(CrossSVDalgo, dataSet, measures=['RMSE'], cv=5, verbose=True)

Evaluating RMSE of algorithm SVD on 5 split(s).

                  Fold 1  Fold 2  Fold 3  Fold 4  Fold 5  Mean    Std
RMSE (testset)    4.0976  4.1125  4.1118  4.0979  4.1019  4.1043  0.0066
Fit time          44.95   45.28   45.40   45.30   45.62   45.31   0.21
Test time         1.54    1.16    1.16    1.47    1.17    1.30    0.17

{'test_rmse': array([4.09755074, 4.11249455, 4.11181677, 4.09789085, 4.10188303]),
 'fit_time': (44.954246044158936,
  45.28276467323303,
  45.40259027481079,
  45.3031280040741,
  45.61664915084839),
 'test_time': (1.5436601638793945,
  1.1578338146209717,
  1.1561369895935059,
  1.4745919704437256,
  1.1695492267608643)}

In [24]:
bsl_options = {'method': 'sgd',  # another option is sgd
                   'n_epochs': 30,  # number of iterations
                   'reg_u': 1,  # user-regularisation parameter
                   'reg_i': 1  # item-regularisation parameter
                   }
bl = BaselineOnly(bsl_options=bsl_options)
bl.fit(train_df)

Estimating biases using sgd...

In [25]:
pred_base=bl.test(test_df)
accuracy.rmse(pred_base)

RMSE: 2.9518

2.9517531939873627

In [36]:
# for product and reviewer

In [ ]:
# ensemble all the models